:PROPERTIES:
:ID:       eb94bcf6-c0ad-4770-8a62-99859bcc875e
:END:
#+TITLE: My Doom Emacs config
#+SETUPFILE:~/org/exobrain/hugo_setup_exobrain.org
#+HUGO_SECTION: exobrain
#+HUGO_CATEGORIES: english configs
#+HUGO_TAGS: emacs
#+STARTUP: overview
#+STARTUP: indent
#+STARTUP: inlineimages
#+OPTIONS: auto-id:nil

** DONE =org-capture=                                             :org_mode:
:PROPERTIES:
:ID:       00d2b45a-0bff-4dd3-af97-98640e9b10e4
:END:
#+BEGIN_SRC emacs-lisp
  ;; Doc: https://github.com/sprig/org-capture-extension
  ;; (defun transform-square-brackets-to-round-ones(string-to-transform)
  ;;   "Transforms [ into ( and ] into ), other chars left unchanged."
  ;;   (concat
  ;;    (mapcar #'(lambda (c) (if (equal c ?[) ?\( (if (equal c ?]) ?\) c))) string-to-transform))
  ;;   )

  ;; CAPTURE
  (after! org
  (setq org-capture-templates
    '(
      ;; Doc: https://github.com/sprig/org-capture-extension
      ;; Doc: https://gist.github.com/cjp/64ac13f5966456841c197f70c7d3a53a
      ("p" "Protocol" entry (file+headline "~/org/capture.org" "Inbox")
        "* [[%:link][%:description]]\n- Source: %:link\n- Title: %:description\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n")
      ("L" "Browser link" entry (file+headline "~/org/capture.org" "Inbox")
        "* [[%:link][%:description]]\n- Source: %:link\n- Title: %:description\n- Captured on: %u\n")

      ;; Templates for the TASKS keyword sequence
      ("t" "Tasks")

      ;; TEMPLATE A
      ("th" "SMART Habit" entry (file org-default-capture-file)
       "* REPEAT %^{Describe the task}       :HABIT:
  %?
  SCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d>>\")
  :STYLE:    habit
  :SMART:
  :Specific:   %^{What is the purpose of this goal}
  :Measurable: %^{How can you measure it}
  :Activity:   %^{What activity do we need to do}
  :Resources:  %^{What resources do we need}
  :Timebox:    %^{What time do we need to spend on that}
  :Reviewed:
  :LOGBOOK:
  - Recorded: %U
  :HoursWeek:  Get it automatically
  :END:" :empty-lines 1)
  )))
#+END_SRC

#+RESULTS:
| p | Protocol | entry | (file+headline ~/org/capture.org Inbox) | * [[%:link][%:description]] |

Use the following extensions:
- Chrome: [[https://chrome.google.com/webstore/detail/org-capture/kkkjlfejijcjgjllecmnejhogpbcigdc]]
- Firefox: [[https://addons.mozilla.org/en-US/firefox/addon/org-capture/]]

Once installed an icon on the top of the browser should appear. To setup the
handler and the templates read: [[https://github.com/sprig/org-capture-extension]]

** IDEA =ein= / Python / Jupyter [NOT WORKING]           :apps:devel:python:
:PROPERTIES:
:ID:       43b9f911-996f-43af-aca0-1d9e1cead088
:END:
#+BEGIN_SRC emacs-lisp
;(use-package! ein
;  :config
;  (setq ob-ein-languages
;   (quote
;    (("ein-python" . python)
;     ("ein-R" . R)
;     ("ein-r" . R)
;     ("ein-rust" . rust)
;     ("ein-haskell" . haskell)
;     ("ein-julia" . julia))))
;   (setq ein:output-area-inlined-images t)
;   ;(setq '(ein:output-area-inlined-images t))
;   (setq ein:slice-image t)
;  )
;
;(after! ein:ipynb-mode
;  (poly-ein-mode 1)
;  (output-area-inlined-images 1)
;  (hungry-delete-mode -1)
;  )
#+END_SRC

See: https://bytemeta.vip/repo/millejoh/emacs-ipython-notebook/issues/793
I am not sure this is working but apparently to use a virtualenv you need to start ein as follows:
#+BEGIN_SRC emacs-lisp :session test
;'(ein:jupyter-server-command "~/.workon-home/venv-geek-hebrew/bin/jupyter")
#+END_SRC

#+RESULTS:
| ein:jupyter-server-command | ~/.workon-home/venv-geek-hebrew/bin/jupyter |

#+BEGIN_SRC emacs-lisp :session test
;(ein:jupyter-server-start)
#+END_SRC

As a minimal example use:
#+NAME: bbc23a93-1a12-4de1-83e0-7a93a418fdfa
#+BEGIN_SRC ein-python :session http://localhost:8889/Untitled.ipynb :results output drawer :tangle no
import matplotlib.pyplot as plt
%matplotlib inline
plt.plot([1,2,3,4,6])
plt.ylabel('some numbers')
plt.show()
#+END_SRC

#+RESULTS: bbc23a93-1a12-4de1-83e0-7a93a418fdfa
:results:
[....]
:end:

Note that =C-c C-c= on =ein-python= blocks +is not+ wasn't working...

Reload org if it is not working with:
#+BEGIN_SRC emacs-lisp
(org-reload)
#+END_SRC

#+RESULTS:
: Successfully reloaded Org
: Org mode version 9.7 (9.7-??-9082fa889 @ /home/av/.emacs.d.doomemacs/.local/straight/build-28.2/org/)

** IDEA =jupyter= / Python / Jupyter                     :apps:devel:python:
:PROPERTIES:
:ID:       69f82f1a-9b2a-4f0c-ad39-c2518eef8d35
:END:
#+BEGIN_SRC emacs-lisp
(use-package! jupyter
  :init
  (setq jupyter-eval-use-overlays t)
  )

(add-hook! '+org-babel-load-functions
    (defun +org-babel-load-jupyter-h (lang)
      (and (string-prefix-p "jupyter-" (symbol-name lang))
       (require 'ob-jupyter)
           (require lang nil t))))

;(org-babel-do-load-languages
; 'org-babel-load-languages
; '((emacs-lisp . t)
;   (python . t)
;   ))
;
;'org-babel-load-languages
;'((emacs-lisp . t)
;  (python . t)
;)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;(use-package! popup
;  :ensure t)
;;; (add-to-list 'load-path "~/.emacs.d/emacs-jupyter")
;(use-package! jupyter
;  :demand t
;  :after (:all org python))
;
;(org-babel-do-load-languages
; 'org-babel-load-languages
; '((emacs-lisp . t)
;   (python . t)
;   (jupyter . t)))
#+END_SRC

Use:
#+BEGIN_SRC elisp
  (pyvenv-activate "~/.workon-home/venv-textfabric")
  (load "ob-jupyter")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(jupyter-run-repl)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(car (jupyter-get-kernelspec "python3"))
#+END_SRC

#+BEGIN_SRC elisp
;  (org-babel-do-load-languages
;   'org-babel-load-languages
;    '((emacs-lisp . t)
;    (python . t)
;    (jupyter . t)
;    (ein . t)
;    (ipython . t)
;    (sclang . t)
;    (ditaa . t)
;    ))
; '(org-babel-load-languages '((python . t) (emacs-lisp . t)))
#+END_SRC

#+RESULTS:
| org-babel-load-languages | '((python . t) (emacs-lisp . t)) |

#+begin_src emacs-lisp
;(org-babel-do-load-languages
;   'org-babel-load-languages
;   '(
;     (emacs-lisp . t)
;     (org . t)
;     (shell . t)
;     (latex . t)
;     (jupyter . t)
;     ))
;(org-babel-jupyter-aliases-from-kernelspecs t)
#+END_SRC

#+BEGIN_SRC jupyter-python :session py :kernel python3 :async yes :tangle no
x = 'foo'
y = 'bar'
x + ' ' + y
#+END_SRC

#+begin_src jupyter-python :session py :results raw drawer :kernel python3 :async yes :tangle no
%matplotlib inline
import numpy as np
import pandas as pd
x = np.linspace(1,100, 10)
y = np.random.normal(size=10)*x
df = pd.DataFrame({'x':x, 'y':y})
df.plot(x='x', y='y')
#+END_SRC

** =org-caldav=
#+NAME: caldav-host-url
#+BEGIN_SRC sh :exports none :noexport:
HOST="http://hs01.i4e.lan:5232/admin"
echo "$HOST"
#+END_SRC

#+BEGIN_SRC sh :var host=caldav-host-url :tangle no
curl -u user -X MKCOL "${host}/sharedcal" --data \
      '<?xml version="1.0" encoding="UTF-8" ?>
  <create xmlns="DAV:" xmlns:C="urn:ietf:params:xml:ns:caldav" xmlns:I="http://apple.com/ns/ical/">
    <set>
      <prop>
        <resourcetype>
          <collection />
          <C:calendar />
        </resourcetype>
        <C:supported-calendar-component-set>
          <C:comp name="VEVENT" />
          <C:comp name="VJOURNAL" />
          <C:comp name="VTODO" />
        </C:supported-calendar-component-set>
        <displayname>Shared calendar</displayname>
        <C:calendar-description>Shared calendar</C:calendar-description>
        <I:calendar-color>#ff0000ff</I:calendar-color>
      </prop>
    </set>
  </create>'
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(use-package! org-caldav
  :ensure t
  :config
  (setq org-caldav-delete-calendar-entries 'always)
  (setq org-caldav-save-directory "~/org/caldav/")
  (setq org-caldav-url
        (or (getenv "EMACS_ORG_CALDAV_URL")
            "http://hs01.i4e.lan:5232/admin")

  (setq org-caldav-calendars
	'((:calendar-id "sharedcal"
                        :files ("~/org/caldav/sharedcal-events.org")
                        :inbox ("~/org/caldav/sharedcal-inbox.org")
                        )))
)

(setq org-icalendar-timezone
      (or (getenv "EMACS_ORG_ICALENDAR_TIMEZONE")
          "Canada/Ontario"))

;; This makes sure to-do items as a category can show up on the calendar
(setq org-icalendar-include-todo 'all
    org-caldav-sync-todo t)
;; This ensures all org "deadlines" show up as due dates
(setq org-icalendar-use-deadline '(todo-due))
;; This ensures "scheduled" org items show up as start times
(setq org-icalendar-use-scheduled '(todo-start))

#+END_SRC

#+RESULTS:
| todo-start |

